## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.keyvault.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "kv-aztf-log-prod-ne-03"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "rg-aztf-logging-prod-ne-02"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.keyvault.azurerm_key_vault.key_vault will be updated in-place
  ~ resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03"
        name                            = "kv-aztf-log-prod-ne-03"
        tags                            = {}
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ ip_rules                   = [
              - "84.10.55.110/32",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.roleassignment-admin-kv.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03/providers/Microsoft.Authorization/roleAssignments/714dce7e-e477-9c55-9c1e-83750a9566d9" -> (known after apply)
      ~ name                                   = "714dce7e-e477-9c55-9c1e-83750a9566d9" -> (known after apply)
      ~ principal_type                         = "User" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.roleassignment-spn-kv.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03/providers/Microsoft.Authorization/roleAssignments/8c4350b0-d9af-a49a-27c0-7a61b8307e95" -> (known after apply)
      ~ name                                   = "8c4350b0-d9af-a49a-27c0-7a61b8307e95" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.roleassignment-spn-kv2.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03/providers/Microsoft.Authorization/roleAssignments/39ef3915-6015-8284-79a4-14ec05b181b6" -> (known after apply)
      ~ name                                   = "39ef3915-6015-8284-79a4-14ec05b181b6" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/21090545-7ca7-4776-b22c-e363652d74d2" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.roleassignment-uami-kv.azurerm_role_assignment.RBAC-AZTF-uami must be replaced
-/+ resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      ~ id                                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03/providers/Microsoft.Authorization/roleAssignments/a6af9250-3f68-96d1-536f-42f685bd1689" -> (known after apply)
      ~ name                                   = "a6af9250-3f68-96d1-536f-42f685bd1689" -> (known after apply)
      ~ principal_id                           = "02980afb-c222-4a6f-9436-fb7dad939c6a" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/providers/Microsoft.Authorization/roleDefinitions/e147488a-f6f5-4113-8e2d-b22465e65bf6" -> (known after apply)
      ~ scope                                  = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.uami.data.azurerm_user_assigned_identity.uami-logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "uami-logs" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "uami-aztf-log-prod-ne-02"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aztf-logging-prod-ne-02"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```
</details>